Revit 2026 API

# ElementQuickFilter Class

---

A base class for a type of filter that operates on element records.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementQuickFilter : ElementFilter
```
```vb
Public Class ElementQuickFilter
	Inherits ElementFilter
```
```cpp
public ref class ElementQuickFilter : public ElementFilter
```
```fsharp
type ElementQuickFilter =
    class
        inherit ElementFilter
    end
```

The ElementQuickFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBBoundingBoxContainsPointFilter Autodesk.Revit.DBBoundingBoxIntersectsFilter Autodesk.Revit.DBBoundingBoxIsInsideFilter Autodesk.Revit.DBElementCategoryFilter Autodesk.Revit.DBElementClassFilter Autodesk.Revit.DBElementDesignOptionFilter Autodesk.Revit.DBElementIdSetFilter Autodesk.Revit.DBElementIsCurveDrivenFilter Autodesk.Revit.DBElementIsElementTypeFilter Autodesk.Revit.DBElementMulticategoryFilter Autodesk.Revit.DBElementMulticlassFilter Autodesk.Revit.DBElementOwnerViewFilter Autodesk.Revit.DBElementStructuralTypeFilter Autodesk.Revit.DBElementWorksetFilter Autodesk.Revit.DBExclusionFilter Autodesk.Revit.DB.ExtensibleStorageExtensibleStorageFilter Autodesk.Revit.DBFamilySymbolFilter Autodesk.Revit.DBVisibleInViewFilter